app/Controllers/Api/AgentController.php

SELECT *
FROM `it_devices`
WHERE `device_token` = '7285c64cc02a1245b40e7366ca04e9e7'
 LIMIT 1
SELECT *
FROM `it_devices`
WHERE `mac_address` = '00:e0:4c:3d:29:84'
 LIMIT 1
---
  public function heartbeat()
  {
    $data = $this->request->getJSON(true);

    if (!$data) {
      return $this->response->setJSON([
        'status' => 'error',
        'message' => 'invalid payload'
      ]);
    }

    // ===== TOKEN =====
    $deviceToken = $data['device_token'] ?? null;

    if (!$deviceToken) {
      $deviceToken = bin2hex(random_bytes(16));
    }

    // ===== FIND DEVICE =====
    $device = null;

    if ($deviceToken) {
      $device = $this->deviceModel
        ->where('device_token', $deviceToken)
        ->first();
    }

    if (!$device && !empty($data['mac'])) {
      $device = $this->deviceModel
        ->where('mac_address', $data['mac'])
        ->first();

SELECT *
FROM `it_devices`
WHERE `it_devices`.`id` = '29'
---
      ]);
    }

    // ===== COMMAND SYSTEM =====
    $device = $this->deviceModel->find($deviceId);