app/Helpers/period_helper.php

  function resolve_period_status(int $inventoryId, string $frequency, string $periodKey): string
  {
    $logModel = new \App\Models\ChecklistLogModel();

    // DONE
    $log = $logModel
      ->where('inventory_id', $inventoryId)
      ->where('period_key', $periodKey)
      ->first();
---
SELECT *
FROM `checklist_logs`
WHERE `inventory_id` = 661
AND `period_key` = '2026-03-02'
 LIMIT 1