app/Helpers/period_status_helper.php

  function resolve_period_status(
    int $inventoryId,
    string $frequency,
    string $periodKey
  ): string {

    $logModel = new ChecklistLogModel();

    // === SUDAH ADA LOG → DONE ===
    $exists = $logModel
      ->where('inventory_id', $inventoryId)
      ->where('period_key', $periodKey)
      ->first();
---
SELECT *
FROM `checklist_logs`
WHERE `inventory_id` = 92
AND `period_key` = '2026-01'
 LIMIT 1