app/Controllers/BaseController.php

SELECT `compliance_inventory`.`id`, `asset_item_types`.`checklist_frequency`
FROM `compliance_inventory`
JOIN `asset_item_types` ON `asset_item_types`.`id` = `compliance_inventory`.`item_type_id`
WHERE `compliance_inventory`.`pic` LIKE '%Asep Beni%' ESCAPE '!'
---
    public function initController(
        RequestInterface $request,
        ResponseInterface $response,
        LoggerInterface $logger
    ) {
        parent::initController($request, $response, $logger);

        // ==============================
        // ROLE SYSTEM
        // ==============================
        $this->role = session()->get('role') ?? 'viewer';

        $this->isWritable = in_array($this->role, [
            'admin',
            'compliance'
        ]);

        // ==============================
        // GLOBAL NOTIFICATION (SIDEBAR)
        // ==============================
        if (session()->get('logged_in')) {

            $inventoryModel = new \App\Models\ComplianceInventoryModel();
            $logModel       = new \App\Models\ChecklistLogModel();

            $userName  = preg_replace('/\s+/', ' ', trim(session('name')));
            $nameParts = explode(' ', $userName);
            $firstTwo  = implode(' ', array_slice($nameParts, 0, 2));

            // Ambil inventory berdasarkan PIC
            $inventories = $inventoryModel
                ->select('compliance_inventory.id, asset_item_types.checklist_frequency')
                ->join('asset_item_types', 'asset_item_types.id = compliance_inventory.item_type_id')
                ->like('compliance_inventory.pic', $firstTwo)
                ->findAll();