app/Controllers/ComplianceDashboardController.php

  public function getTotalInventoryByType()
  {
    $type = $this->request->getGet('type');

    $inventoryModel = new \App\Models\ComplianceInventoryModel();

    $total = $inventoryModel
      ->join('asset_item_types', 'asset_item_types.id = compliance_inventory.item_type_id')
      ->where('asset_item_types.checklist_frequency', $type)
      ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `compliance_inventory`
JOIN `asset_item_types` ON `asset_item_types`.`id` = `compliance_inventory`.`item_type_id`
WHERE `asset_item_types`.`checklist_frequency` = 'monthly'

  public function getRiskInsightAjax()
  {
    try {

      $year  = $this->request->getGet('year');
      $month = $this->request->getGet('month');

      // ======================
      // TOP ITEM BULAN INI
      // ======================

      $builder = $this->logModel->builder();

      $builder->select('asset_item_types.id as item_type_id, asset_item_types.name as item_name, COUNT(*) as total', false);
      $builder->join('asset_item_types', 'asset_item_types.id = checklist_logs.item_type_id');
      $builder->where('checklist_logs.status', 'not_ok');
      $builder->like('checklist_logs.period_key', $year . '-' . $month, 'after');
      $builder->groupBy('asset_item_types.id');
      $builder->orderBy('total', 'DESC');
      $builder->limit(5);

      $topItems = $builder->get()->getResultArray();
---
SELECT asset_item_types.id as item_type_id, asset_item_types.name as item_name, COUNT(*) as total
FROM `checklist_logs`
JOIN `asset_item_types` ON `asset_item_types`.`id` = `checklist_logs`.`item_type_id`
WHERE `checklist_logs`.`status` = 'not_ok'
AND  `checklist_logs`.`period_key` LIKE '2026-03%' ESCAPE '!'
GROUP BY `asset_item_types`.`id`
ORDER BY `total` DESC
 LIMIT 5