app/Controllers/ComplianceChecklistMasterController.php

SELECT *
FROM `inventory_categories`
WHERE `active` = 1
ORDER BY `name`
---
  public function masterIndex()
  {
    $categories = $this->inventoryCategoryModel
      ->where('active', 1)
      ->orderBy('name')
      ->findAll();