app/Controllers/ComplianceInventoryController.php

  public function checklist($inventoryId)
  {
    $inventory = $this->inventoryModel
      ->select('
            compliance_inventory.*,
            asset_item_types.name AS item_display_name
        ')
      ->join('asset_item_types', 'asset_item_types.id = compliance_inventory.item_type_id', 'left')
      ->where('compliance_inventory.id', $inventoryId)
      ->first();

    if (!$inventory) {
      throw new \CodeIgniter\Exceptions\PageNotFoundException();
    }
    $checklistMasterModel = new \App\Models\ChecklistMasterModel();

    $frequencyRow = $checklistMasterModel
      ->select('frequency')
      ->where('item_type_id', $inventory['item_type_id'])
      ->where('active', 1)
      ->groupBy('frequency')
      ->first();

    if (!$frequencyRow) {
      return redirect()->back()
        ->with('error', 'Checklist belum diatur untuk item ini.');
---
SELECT `compliance_inventory`.*, `asset_item_types`.`name` AS `item_display_name`
FROM `compliance_inventory`
LEFT JOIN `asset_item_types` ON `asset_item_types`.`id` = `compliance_inventory`.`item_type_id`
WHERE `compliance_inventory`.`id` = '36'
 LIMIT 1

  public function submitChecklist()
  {
    $inventoryId = $this->request->getPost('inventory_id');
    $periodKey   = $this->request->getPost('period_key');
    $frequency   = $this->request->getPost('frequency');
    $itemTypeId  = $this->request->getPost('item_type_id');
    $questions = $this->request->getPost('questions');
    $remarks   = $this->request->getPost('remarks') ?? [];
    $photos    = $this->request->getFiles()['photos'] ?? [];
    $user      = session()->get('name');

    if (!is_array($questions)) {
      return redirect()->back()->with('error', 'Checklist tidak valid.');
    }

    $logModel = new \App\Models\ChecklistLogModel();

    // === LOCK PER PERIODE ===
    $exists = $logModel
      ->where('inventory_id', $inventoryId)
      ->where('period_key', $periodKey)
      ->first();
---
SELECT *
FROM `checklist_logs`
WHERE `inventory_id` = '36'
AND `period_key` = '2026-01-W2'
 LIMIT 1