app/Controllers/ComplianceInventoryController.php

      $lockReason = 'expired';
    }

    // ================= QUESTIONS =================
    $questions = (new \App\Models\ChecklistMasterModel())
      ->where('item_type_id', $inventory['item_type_id'])
      ->where('active', 1)
      ->orderBy('id', 'ASC')
      ->findAll();
---
SELECT *
FROM `checklist_master`
WHERE `item_type_id` = '52'
AND `active` = 1
ORDER BY `id` ASC