app/Controllers/ComplianceReportController.php

  public function index()
  {
    $categories = model(InventoryCategoryModel::class)
      ->orderBy('name', 'ASC')
      ->findAll();
---
SELECT *
FROM `inventory_categories`
ORDER BY `name` ASC