app/Controllers/ComplianceInventoryController.php

SELECT *
FROM `areas`
---
        ->groupEnd();
    }

    return view('compliance/inventory/index', [
      'inventories' => $query->paginate($perPage),
      'pager'       => $this->inventoryModel->pager,
      'categories'  => $this->categoryModel->findAll(),
      'areas'       => $this->areaModel->findAll(),
      'category'    => $categoryId,
      'area'        => $areaId,
      'keyword'     => $keyword,
      'perPage'     => $perPage,
      'isWritable'  => true
    ]);

SELECT *
FROM `checklist_logs`
WHERE `inventory_id` = '101'
AND  `period_key` LIKE '2026-03%' ESCAPE '!'
---

    // =========================
    // AMBIL LOG BULAN AKTIF
    // =========================
    $logs = (new \App\Models\ChecklistLogModel())
      ->where('inventory_id', $id)
      ->like('period_key', $ym, 'after')
      ->findAll();

SELECT *
FROM `checklist_master`
WHERE `item_type_id` = '1'
ORDER BY `id` ASC
---

    // =========================
    // AMBIL SEMUA PERTANYAAN
    // =========================
    $questions = (new \App\Models\ChecklistMasterModel())
      ->where('item_type_id', $inventory['item_type_id'])
      ->orderBy('id', 'ASC')
      ->findAll();

SELECT `period_key`, MAX(check_date) as check_date, MAX(checked_by) as checked_by
FROM `checklist_logs`
WHERE `inventory_id` = '101'
GROUP BY `period_key`
ORDER BY `check_date` DESC
---
      }
    }

    $checklists = (new \App\Models\ChecklistLogModel())
      ->select('
        period_key,
        MAX(check_date) as check_date,
        MAX(checked_by) as checked_by
    ')
      ->where('inventory_id', $id)
      ->groupBy('period_key')
      ->orderBy('check_date', 'DESC')
      ->findAll();

SELECT `checklist_logs`.*, `checklist_master`.`question`
FROM `checklist_logs`
LEFT JOIN `checklist_master` ON `checklist_master`.`id` = `checklist_logs`.`checklist_template_id`
WHERE `checklist_logs`.`inventory_id` = '101'
AND `checklist_logs`.`period_key` = '2026-03'
ORDER BY `checklist_logs`.`checklist_template_id` ASC
---

    // =========================
    // MONTHLY DETAIL
    // =========================
    $detailLogs = (new \App\Models\ChecklistLogModel())
      ->select('
            checklist_logs.*,
            checklist_master.question
        ')
      ->join(
        'checklist_master',
        'checklist_master.id = checklist_logs.checklist_template_id',
        'left'
      )
      ->where('checklist_logs.inventory_id', $id)
      ->where('checklist_logs.period_key', $ym)
      ->orderBy('checklist_logs.checklist_template_id', 'ASC')
      ->findAll();

SELECT *
FROM `checklist_master`
WHERE `item_type_id` = '33'
AND `active` = 1
ORDER BY `id` ASC
---
    }


    // ================= QUESTIONS =================
    $questions = (new \App\Models\ChecklistMasterModel())
      ->where('item_type_id', $inventory['item_type_id'])
      ->where('active', 1)
      ->orderBy('id', 'ASC')
      ->findAll();