app/Controllers/ComplianceDashboardController.php

  private function getKpiSummary($year)
  {
    // Total inventory compliance aktif
    $totalInventory = $this->inventoryModel
      ->where('status', 1)
      ->countAllResults();

    // Ambil semua log tahun terpilih mulai 2026
    $logs = $this->checklistLogModel
      ->where('created_at >=', $this->startDate)
      ->where('YEAR(created_at)', $year)
      ->findAll();
---
SELECT *
FROM `checklist_logs`
WHERE `created_at` >= '2026-01-01 00:00:00'
AND YEAR(created_at) = '2026'


    // ===============================
    // 2️⃣ NOT_OK TERBARU (5 TERAKHIR)
    // ===============================
    $notOkLogs = $this->checklistLogModel
      ->where('status', 'not_ok')
      ->orderBy('created_at', 'DESC')
      ->limit(5)
      ->findAll();
---
SELECT *
FROM `checklist_logs`
WHERE `status` = 'not_ok'
ORDER BY `created_at` DESC
 LIMIT 5


      if (!$inventory) continue;

      $itemType = $this->itemTypeModel
        ->find($inventory['item_type_id']);
---
SELECT *
FROM `asset_item_types`
WHERE `asset_item_types`.`id` = '33'

  private function getLatestNotOkWithPhoto($year)
  {
    return $this->checklistLogModel
      ->where('created_at >=', $this->startDate)
      ->where('YEAR(created_at)', $year)
      ->where('status', 'not_ok')
      ->where('photo IS NOT NULL')
      ->orderBy('created_at', 'DESC')
      ->limit(10)
      ->findAll();
---
SELECT *
FROM `checklist_logs`
WHERE `created_at` >= '2026-01-01 00:00:00'
AND YEAR(created_at) = '2026'
AND `status` = 'not_ok'
AND `photo` IS NOT NULL
ORDER BY `created_at` DESC
 LIMIT 10

  private function getMonthlyTrend($year)
  {
    $result = array_fill(1, 12, 0);

    $logs = $this->checklistLogModel
      ->select("MONTH(created_at) as month, COUNT(*) as total")
      ->where('created_at >=', $this->startDate)
      ->where('YEAR(created_at)', $year)
      ->groupBy("MONTH(created_at)")
      ->findAll();
---
SELECT MONTH(created_at) as month, COUNT(*) as total
FROM `checklist_logs`
WHERE `created_at` >= '2026-01-01 00:00:00'
AND YEAR(created_at) = '2026'
GROUP BY MONTH(created_at)

  private function getChecklistOverview()
  {
    $overview = [];

    $inventories = $this->inventoryModel
      ->where('active', 1)
      ->findAll();

    foreach ($inventories as $inv) {

      $itemType = $this->itemTypeModel
        ->find($inv['item_type_id']);
---
SELECT *
FROM `asset_item_types`
WHERE `asset_item_types`.`id` = '1'