app/Controllers/ITDeviceController.php

  public function index()
  {
    helper('device');

    $devices = $this->deviceModel->findAll();
---
SELECT *
FROM `it_devices`